/*
 * 2022-05-08 22:39
 * 问题： 给定一个数组 nums，编写一个函数将所有 0 移动到数组的末尾，同时保持非零元素的相对顺序
 * 输入: nums = [0,1,0,3,12]
 * 输出: [1,3,12,0,0]
 * 
 * 思路1: 先遍历一遍统计0的个数，然后移动数据
 * 思路2: 删除数组中重复数据一样，用两个指针，一个指向当前非0位置，一个遍历全数组。遍历完成时，从非0位置到数组末尾重设0
 *      优化：可以直接在移动后直接设置0
 * 
 * 测试：[1], [0], [0,0,0] [0,0,1], [1,2], [1,2, 0, 0]
 */

void moveZeroes(int* nums, int numsSize){
    if(numsSize <= 1) return;
    int i, j;
    i = -1, j = 0;
    while(j < numsSize) {
        if(nums[j] != 0) {
            i++;
            if(i != j) {
                nums[i] = nums[j];
                nums[j] = 0;
            }
        }
        j++;
    }
}